wzurawski015/esp8266-event-driven-framework/adapters/esp8266_rtos_sdk/components/ev_platform/ev_i2c_adapter.c
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"


#include "driver/gpio.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "rom/ets_sys.h"

#include "ev/esp8266_port_adapters.h"

/*
 * Zero-heap ESP8266 I2C master.
 *
 * The ESP8266 RTOS SDK command-link API allocates command descriptors from the
 * heap through command-link creation.  This adapter intentionally does not install or
 * use the SDK I2C command-link driver.  The ESP8266 RTOS SDK does not expose
 * FreeRTOS static semaphore allocation in its supported configuration, so this
 * adapter owns one bootstrap-time mutex and a bounded GPIO open-drain software
 * master for all runtime transactions.
 */
#define EV_I2C_MAX_COMMANDS_PER_TRANSACTION 16U

#define EV_ESP8266_I2C_CMD_TIMEOUT_MS 150U
#define EV_ESP8266_I2C_TRANSACTION_TIMEOUT_US ((int64_t)EV_ESP8266_I2C_CMD_TIMEOUT_MS * 1000LL)
#define EV_ESP8266_I2C_MUTEX_TIMEOUT_MS 250U
#define EV_ESP8266_I2C_MUTEX_TIMEOUT_TICKS pdMS_TO_TICKS(EV_ESP8266_I2C_MUTEX_TIMEOUT_MS)
#define EV_ESP8266_I2C_SPEED_SAFE_HZ 100000U
#define EV_ESP8266_I2C_SPEED_FAST_HZ 400000U
#ifndef EV_ESP8266_I2C_TARGET_SPEED_HZ
#define EV_ESP8266_I2C_TARGET_SPEED_HZ EV_ESP8266_I2C_SPEED_SAFE_HZ
#endif
#if EV_ESP8266_I2C_TARGET_SPEED_HZ == 0U
#error "ESP8266 I2C target speed must be non-zero"
#endif
#if (EV_ESP8266_I2C_TARGET_SPEED_HZ > EV_ESP8266_I2C_SPEED_SAFE_HZ) && !defined(EV_ESP8266_I2C_FAST_MODE_LOGIC_ANALYZER_EVIDENCE)
#error "ESP8266 I2C >100 kHz requires explicit logic-analyzer evidence acknowledgement"
#endif
#if (EV_ESP8266_I2C_TARGET_SPEED_HZ > EV_ESP8266_I2C_SPEED_FAST_HZ) && !defined(EV_ESP8266_I2C_TURBO_LAB_ONLY)
#error "ESP8266 I2C >400 kHz is lab-only and requires explicit turbo acknowledgement"
#endif
#define EV_ESP8266_I2C_TARGET_HALF_PERIOD_US \
    ((500000U + EV_ESP8266_I2C_TARGET_SPEED_HZ - 1U) / EV_ESP8266_I2C_TARGET_SPEED_HZ)
#define EV_ESP8266_I2C_HALF_PERIOD_US ((EV_ESP8266_I2C_TARGET_HALF_PERIOD_US > 0U) ? EV_ESP8266_I2C_TARGET_HALF_PERIOD_US : 1U)
#if (EV_ESP8266_I2C_TARGET_SPEED_HZ == EV_ESP8266_I2C_SPEED_SAFE_HZ) && (EV_ESP8266_I2C_HALF_PERIOD_US != 5U)
#error "ESP8266 I2C 100 kHz safe profile must use a 5 us half-period"
#endif
#if (EV_ESP8266_I2C_TARGET_SPEED_HZ == EV_ESP8266_I2C_SPEED_FAST_HZ) && (EV_ESP8266_I2C_HALF_PERIOD_US != 2U)
#error "ESP8266 I2C 400 kHz evidence-gated profile must use a conservative 2 us nominal half-period until measured"
#endif
#define EV_ESP8266_I2C_CLOCK_STRETCH_TIMEOUT_US 300U
#define EV_ESP8266_I2C_RECOVERY_PULSES 9U
#define EV_ESP8266_I2C_MAX_PAYLOAD_BYTES 64U

#define EV_ESP8266_I2C_WRITE_STREAM_COMMANDS 4U
#define EV_ESP8266_I2C_WRITE_REGS_COMMANDS 5U
#define EV_ESP8266_I2C_READ_STREAM_COMMANDS 5U
#define EV_ESP8266_I2C_READ_REGS_COMMANDS 8U

#if EV_ESP8266_I2C_WRITE_STREAM_COMMANDS > EV_I2C_MAX_COMMANDS_PER_TRANSACTION
#error "EV_I2C_MAX_COMMANDS_PER_TRANSACTION is too small for write_stream"
#endif
#if EV_ESP8266_I2C_WRITE_REGS_COMMANDS > EV_I2C_MAX_COMMANDS_PER_TRANSACTION
#error "EV_I2C_MAX_COMMANDS_PER_TRANSACTION is too small for write_regs"
#endif
#if EV_ESP8266_I2C_READ_STREAM_COMMANDS > EV_I2C_MAX_COMMANDS_PER_TRANSACTION
#error "EV_I2C_MAX_COMMANDS_PER_TRANSACTION is too small for read_stream"
#endif
#if EV_ESP8266_I2C_READ_REGS_COMMANDS > EV_I2C_MAX_COMMANDS_PER_TRANSACTION
#error "EV_I2C_MAX_COMMANDS_PER_TRANSACTION is too small for read_regs"
#endif

static const char *const k_ev_i2c_tag = "ev_i2c";

typedef enum ev_esp8266_i2c_phase {
    EV_ESP8266_I2C_PHASE_IDLE = 0,
    EV_ESP8266_I2C_PHASE_START = 1,
    EV_ESP8266_I2C_PHASE_ADDR_W = 2,
    EV_ESP8266_I2C_PHASE_REG = 3,
    EV_ESP8266_I2C_PHASE_DATA_W = 4,
    EV_ESP8266_I2C_PHASE_RESTART = 5,
    EV_ESP8266_I2C_PHASE_ADDR_R = 6,
    EV_ESP8266_I2C_PHASE_DATA_R = 7,
    EV_ESP8266_I2C_PHASE_FINAL_NACK = 8,
    EV_ESP8266_I2C_PHASE_STOP = 9,
    EV_ESP8266_I2C_PHASE_RELEASE = 10
} ev_esp8266_i2c_phase_t;

typedef struct ev_esp8266_i2c_adapter_ctx {
    ev_i2c_port_num_t port_num;
    int sda_pin;
    int scl_pin;
    bool configured;
    uint32_t transactions_started;
    uint32_t transactions_failed;
    uint32_t nacks;
    uint32_t timeouts;
    uint32_t bus_locked;
    uint32_t bus_recoveries;
    uint32_t bus_recovery_failures;
    uint32_t address_write_acks;
    uint32_t address_write_nacks;
    uint32_t address_read_acks;
    uint32_t address_read_nacks;
    uint32_t data_write_acks;
    uint32_t data_write_nacks;
    uint32_t read_bytes;
    uint32_t read_final_nack_sent;
    uint32_t stop_attempted;
    uint32_t stop_ok;
    uint32_t stop_release_fail;
    uint32_t bus_idle_after_stop_ok;
    uint32_t bus_idle_after_stop_fail;
    uint32_t transaction_lock_count;
    uint32_t transaction_unlock_count;
    uint32_t transaction_lock_unbalanced;
    uint32_t sleep_prepare_attempts;
    uint32_t sleep_prepare_failures;
    ev_i2c_status_t last_status;
    uint8_t last_addr_7bit;
    uint8_t last_phase;
    bool last_sda_high_after_stop;
    bool last_scl_high_after_stop;
    volatile bool transaction_active;
} ev_esp8266_i2c_adapter_ctx_t;

static SemaphoreHandle_t g_ev_i2c_bus_mutex = NULL;

static ev_esp8266_i2c_adapter_ctx_t g_ev_i2c0_ctx = {
    .port_num = EV_I2C_PORT_NUM_0,
    .sda_pin = -1,
    .scl_pin = -1,
    .configured = false,
};

static void ev_esp8266_i2c_reset_diag(ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    if (ctx == NULL) {
        return;
    }
    ctx->transactions_started = 0U;
    ctx->transactions_failed = 0U;
    ctx->nacks = 0U;
    ctx->timeouts = 0U;
    ctx->bus_locked = 0U;
    ctx->bus_recoveries = 0U;
    ctx->bus_recovery_failures = 0U;
    ctx->address_write_acks = 0U;
    ctx->address_write_nacks = 0U;
    ctx->address_read_acks = 0U;
    ctx->address_read_nacks = 0U;
    ctx->data_write_acks = 0U;
    ctx->data_write_nacks = 0U;
    ctx->read_bytes = 0U;
    ctx->read_final_nack_sent = 0U;
    ctx->stop_attempted = 0U;
    ctx->stop_ok = 0U;
    ctx->stop_release_fail = 0U;
    ctx->bus_idle_after_stop_ok = 0U;
    ctx->bus_idle_after_stop_fail = 0U;
    ctx->transaction_lock_count = 0U;
    ctx->transaction_unlock_count = 0U;
    ctx->transaction_lock_unbalanced = 0U;
    ctx->sleep_prepare_attempts = 0U;
    ctx->sleep_prepare_failures = 0U;
    ctx->last_status = EV_I2C_OK;
    ctx->last_addr_7bit = 0U;
    ctx->last_phase = (uint8_t)EV_ESP8266_I2C_PHASE_IDLE;
    ctx->last_sda_high_after_stop = false;
    ctx->last_scl_high_after_stop = false;
    ctx->transaction_active = false;
}

static bool ev_esp8266_i2c_pin_is_valid(int pin)
{
    /*
     * GPIO16 is intentionally rejected for I2C.  On ESP8266 it is not a normal
     * GPIO matrix pin and is also a common deep-sleep wake line, so using it as
     * open-drain I2C would violate the BSP/power assumptions.
     */
    return (pin >= 0) && (pin <= 15);
}

static bool ev_esp8266_i2c_txn_is_valid(const ev_esp8266_i2c_adapter_ctx_t *ctx,
                                        ev_i2c_port_num_t port_num,
                                        uint8_t device_address_7bit)
{
    return (ctx != NULL) && ctx->configured && (ctx->port_num == port_num) && (device_address_7bit <= 0x7FU);
}

static bool ev_esp8266_i2c_payload_len_is_valid(size_t data_len)
{
    return data_len <= EV_ESP8266_I2C_MAX_PAYLOAD_BYTES;
}

