wzurawski015/esp8266-event-driven-framework/adapters/esp8266_rtos_sdk/components/ev_platform/ev_i2c_adapter.c
static ev_esp8266_i2c_adapter_ctx_t *ev_esp8266_i2c_ctx_from_port(ev_i2c_port_num_t port_num)
{
    if (port_num == EV_I2C_PORT_NUM_0) {
        return &g_ev_i2c0_ctx;
    }
    return NULL;
}

ev_result_t ev_i2c_scan(ev_i2c_port_num_t port_num)
{
    ev_esp8266_i2c_adapter_ctx_t *ctx = ev_esp8266_i2c_ctx_from_port(port_num);
    bool found_any = false;
    bool found_rtc = false;
    bool found_oled = false;
    bool found_mcp = false;
    uint8_t device_address_7bit;

    if (ctx == NULL) {
        return EV_ERR_UNSUPPORTED;
    }
    if (!ctx->configured) {
        return EV_ERR_STATE;
    }

    ESP_LOGI(k_ev_i2c_tag,
             "i2c-scan: start port=%u SDA=%d SCL=%d",
             (unsigned)port_num,
             ctx->sda_pin,
             ctx->scl_pin);

    for (device_address_7bit = 0x03U; device_address_7bit < 0x78U; ++device_address_7bit) {
        ev_i2c_status_t status = ev_esp8266_i2c_write_stream(ctx, port_num, device_address_7bit, NULL, 0U);

        if (status == EV_I2C_OK) {
            const char *device_name = ev_esp8266_i2c_known_device_name(device_address_7bit);
            found_any = true;

            if (device_address_7bit == 0x68U) {
                found_rtc = true;
            }
            if ((device_address_7bit >= 0x20U) && (device_address_7bit <= 0x27U)) {
                found_mcp = true;
            }
            if ((device_address_7bit == 0x3CU) || (device_address_7bit == 0x3DU)) {
                found_oled = true;
            }

            if (device_name != NULL) {
                ESP_LOGI(k_ev_i2c_tag,
                         "i2c-scan: found 0x%02X (%s)",
                         (unsigned)device_address_7bit,
                         device_name);
            } else {
                ESP_LOGI(k_ev_i2c_tag, "i2c-scan: found 0x%02X", (unsigned)device_address_7bit);
            }
        }
    }

    if (!found_any) {
        ESP_LOGW(k_ev_i2c_tag, "i2c-scan: no devices acknowledged");
    }
    if (found_rtc) {
        ESP_LOGI(k_ev_i2c_tag, "rtc-probe: detected device at 0x68");
    } else {
        ESP_LOGW(k_ev_i2c_tag, "rtc-probe: no response at 0x68");
    }
    if (found_mcp) {
        ESP_LOGI(k_ev_i2c_tag, "mcp23008-probe: detected device in range 0x20-0x27");
    } else {
        ESP_LOGW(k_ev_i2c_tag, "mcp23008-probe: no response in range 0x20-0x27");
    }
    if (found_oled) {
        ESP_LOGI(k_ev_i2c_tag, "oled-probe: detected device at 0x3C or 0x3D");
    } else {
        ESP_LOGI(k_ev_i2c_tag, "oled-probe: optional OLED not detected");
    }

    return EV_OK;
}


ev_result_t ev_esp8266_i2c_get_diag(ev_i2c_port_num_t port_num, ev_esp8266_i2c_diag_snapshot_t *out_snapshot)
{
    ev_esp8266_i2c_adapter_ctx_t *ctx = ev_esp8266_i2c_ctx_from_port(port_num);

    if (out_snapshot == NULL) {
        return EV_ERR_INVALID_ARG;
    }
    if ((ctx == NULL) || !ctx->configured) {
        return EV_ERR_STATE;
    }

    out_snapshot->transactions_started = ctx->transactions_started;
    out_snapshot->transactions_failed = ctx->transactions_failed;
    out_snapshot->nacks = ctx->nacks;
    out_snapshot->timeouts = ctx->timeouts;
    out_snapshot->bus_locked = ctx->bus_locked;
    out_snapshot->bus_recoveries = ctx->bus_recoveries;
    out_snapshot->bus_recovery_failures = ctx->bus_recovery_failures;
    out_snapshot->address_write_acks = ctx->address_write_acks;
    out_snapshot->address_write_nacks = ctx->address_write_nacks;
    out_snapshot->address_read_acks = ctx->address_read_acks;
    out_snapshot->address_read_nacks = ctx->address_read_nacks;
    out_snapshot->data_write_acks = ctx->data_write_acks;
    out_snapshot->data_write_nacks = ctx->data_write_nacks;
    out_snapshot->read_bytes = ctx->read_bytes;
    out_snapshot->read_final_nack_sent = ctx->read_final_nack_sent;
    out_snapshot->stop_attempted = ctx->stop_attempted;
    out_snapshot->stop_ok = ctx->stop_ok;
    out_snapshot->stop_release_fail = ctx->stop_release_fail;
    out_snapshot->bus_idle_after_stop_ok = ctx->bus_idle_after_stop_ok;
    out_snapshot->bus_idle_after_stop_fail = ctx->bus_idle_after_stop_fail;
    out_snapshot->transaction_lock_count = ctx->transaction_lock_count;
    out_snapshot->transaction_unlock_count = ctx->transaction_unlock_count;
    out_snapshot->transaction_lock_unbalanced = ctx->transaction_lock_unbalanced;
    out_snapshot->sleep_prepare_attempts = ctx->sleep_prepare_attempts;
    out_snapshot->sleep_prepare_failures = ctx->sleep_prepare_failures;
    out_snapshot->last_status = ctx->last_status;
    out_snapshot->last_addr_7bit = ctx->last_addr_7bit;
    out_snapshot->last_phase = ctx->last_phase;
    out_snapshot->transaction_active = ctx->transaction_active;
    out_snapshot->sda_high = ev_esp8266_i2c_sample_sda(ctx);
    out_snapshot->scl_high = ev_esp8266_i2c_sample_scl(ctx);
    out_snapshot->last_sda_high_after_stop = ctx->last_sda_high_after_stop;
    out_snapshot->last_scl_high_after_stop = ctx->last_scl_high_after_stop;
    return EV_OK;
}
ev_result_t ev_esp8266_i2c_prepare_for_sleep(ev_i2c_port_num_t port_num)
{
    ev_esp8266_i2c_adapter_ctx_t *ctx = ev_esp8266_i2c_ctx_from_port(port_num);
    ev_i2c_status_t status;
    int64_t started_us;

    if ((ctx == NULL) || !ctx->configured) {
        return EV_ERR_STATE;
    }

    ++ctx->sleep_prepare_attempts;
    if (ctx->transaction_active) {
        ++ctx->sleep_prepare_failures;
        return EV_ERR_STATE;
    }

    status = ev_esp8266_i2c_take_bus_with_timeout(ctx, 0);
    if (status != EV_I2C_OK) {
        ++ctx->sleep_prepare_failures;
        (void)ev_esp8266_i2c_record_status(ctx, status);
        return EV_ERR_STATE;
    }

    if (ctx->transaction_active) {
        ++ctx->sleep_prepare_failures;
        ev_esp8266_i2c_give_bus(ctx);
        return EV_ERR_STATE;
    }

    started_us = esp_timer_get_time();
    status = ev_esp8266_i2c_prepare_bus(ctx, started_us);
    ev_esp8266_i2c_release_bus_lines(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);
    if ((status == EV_I2C_OK) && (!ev_esp8266_i2c_sample_sda(ctx) || !ev_esp8266_i2c_sample_scl(ctx))) {
        status = EV_I2C_ERR_BUS_LOCKED;
    }

